; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj3 obj8 - airport
	obj1 obj4 - city
	obj2 obj5 obj12 obj13 obj15 obj16 - package
	obj6 obj10 - airplane
	obj7 obj9 obj11 obj14 - truck
)

(:init
	(in-city obj3 obj4)
	(at obj7 obj0)
	(at obj13 obj3)
	(at obj14 obj8)
	(at obj2 obj0)
	(at obj9 obj0)
	(at obj10 obj0)
	(at obj16 obj0)
	(at obj5 obj0)
	(at obj6 obj0)
	(in-city obj8 obj4)
	(at obj15 obj3)
	(at obj11 obj0)
	(at obj12 obj0)
	(in-city obj0 obj1)
)

(:goal (and
	(at obj15 obj0)
	(at obj16 obj3)
	(at obj5 obj8)
	(at obj12 obj8)
	(at obj13 obj0)
	(at obj2 obj8)
))
)

; plan
1. (fly obj6 obj0 obj3)
   deleted: (at obj6 obj0)
   added: (at obj6 obj3)
   goals met: 0 of 6
2. (load obj6 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj6)
   goals met: 0 of 6
3. (load obj6 obj13 obj3)
   deleted: (at obj13 obj3)
   added: (in obj13 obj6)
   goals met: 0 of 6
4. (fly obj6 obj3 obj0)
   deleted: (at obj6 obj3)
   added: (at obj6 obj0)
   goals met: 0 of 6
5. (load obj6 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj6)
   goals met: 0 of 6
6. (load obj6 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj6)
   goals met: 0 of 6
7. (load obj6 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj6)
   goals met: 0 of 6
8. (fly obj6 obj0 obj3)
   deleted: (at obj6 obj0)
   added: (at obj6 obj3)
   goals met: 0 of 6
9. (unload obj6 obj16 obj3)
   deleted: (in obj16 obj6)
   added: (at obj16 obj3)
   goals met: 1 of 6
10. (fly obj6 obj3 obj0)
   deleted: (at obj6 obj3)
   added: (at obj6 obj0)
   goals met: 1 of 6
11. (unload obj6 obj15 obj0)
   deleted: (in obj15 obj6)
   added: (at obj15 obj0)
   goals met: 2 of 6
12. (unload obj6 obj13 obj0)
   deleted: (in obj13 obj6)
   added: (at obj13 obj0)
   goals met: 3 of 6
13. (load obj6 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj6)
   goals met: 3 of 6
14. (fly obj6 obj0 obj8)
   deleted: (at obj6 obj0)
   added: (at obj6 obj8)
   goals met: 3 of 6
15. (unload obj6 obj5 obj8)
   deleted: (in obj5 obj6)
   added: (at obj5 obj8)
   goals met: 4 of 6
16. (unload obj6 obj2 obj8)
   deleted: (in obj2 obj6)
   added: (at obj2 obj8)
   goals met: 5 of 6
17. (unload obj6 obj12 obj8)
   deleted: (in obj12 obj6)
   added: (at obj12 obj8)
   goals met: 6 of 6
